#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Author: Joshua
# @E-Mail: liuchaozhen@neusoft.com
# @Date:   2015-02-10 13:06:34
# @About terminal_color.py

# 格式：\033[显示方式;前景色;背景色m
 
# 说明：
# 前景色            背景色           颜色
# ---------------------------------------
# 30                40              黑色
# 31                41              红色
# 32                42              绿色
# 33                43              黄色
# 34                44              蓝色
# 35                45              紫红色
# 36                46              青蓝色
# 37                47              白色
# 显示方式           意义
# -------------------------
# 0                终端默认设置
# 1                高亮显示
# 4                使用下划线
# 5                闪烁
# 7                反白显示
# 8                不可见

print('\033[1;32;32m')
print('绿了都')
print('\033[0m')

print('\033[1;43;43m')
print('黄了都')
print('\033[0m')

print('\033[4;35;35m')
print('下划线紫了都')
print('\033[0m')